In [2]:
import pandas as pd

In [15]:
df=pd.DataFrame({"Name":['Tom','Nick','John','Peter'],
                "Age":[15,26,17,28]})
df

    Name  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

#### Method #1: Using df.columns and df.index

In [4]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [7]:
list(df.index)

[0, 1, 2, 3]

In [8]:
df.columns=['col1','col2']
df

    col1  col2
0    Tom    15
1   Nick    26
2   John    17
3  Peter    28

In [10]:
df.index=['row1','row2','row3','row4']
df

       col1  col2
row1    Tom    15
row2   Nick    26
row3   John    17
row4  Peter    28

#### cannot use reindex()

#### pandas.DataFrame.reindex-->
A new object is produced unless the new index is equivalent to the current one and copy=False
cannot be used to rename as new object is created whenever we give new indexes and previous index data is not
copied in new indexes and as aresult we get NAN as values

In [29]:
df.reindex(index=['row11','row21','row31','row41'])

      Name  Age
row11  NaN  NaN
row21  NaN  NaN
row31  NaN  NaN
row41  NaN  NaN

### Method #2: Using rename() function with dictionary

In [30]:
df

    Name  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [33]:
df.rename(mapper={'Name':'name','Age':'age'},axis=1)

    name  age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [34]:
df.rename({'Name':'name','Age':'age'},axis=1)

    name  age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

### Method #3: Using Lambda Function to rename the columns

In [36]:
df.rename(lambda x:x.upper(),axis=1)

#df.rename(columns=lambda x:x.upper())
#df.rename(mapper=lambda x:x.upper(),axis=1)
#all 3 will yield same result

    NAME  AGE
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

### Method #4: Using values attribute to rename the columns.Return a Numpy representation of the DataFrame.

In [45]:
df.values #array

array([['Tom', 15],
       ['Nick', 26],
       ['John', 17],
       ['Peter', 28]], dtype=object)

In [50]:
df.columns.values #array

array(['Name', 'Age'], dtype=object)

In [51]:
df.index.values
#array

array([0, 1, 2, 3], dtype=int64)

In [52]:
df.columns.values[0]='names'  #modifying as if we are modifiying an array element

In [53]:
df

   names  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [59]:
df.columns.values)

int

In [57]:
df.columns.values[0]
df.columns.values[1]

'Age'

In [62]:
df.rename(lambda x:x+10)

    names  Age
10    Tom   15
11   Nick   26
12   John   17
13  Peter   28